import { MockData } from './mock-data.type';

export const mockData: MockData = {
  textFeedbacks: [
    'Спасибо большое за отличную круговую тренировку. Была первый раз у Леры Котыревой, очень понравилось! Обязательно пойду ещё!',
    'Занятие по йоге – отличное! Настя Орлова -  супер!! Нагрузку дала по полной, а в конце расслабление с поющей чашей бывает только у нее. Знаю, что нравится не только мне одной.',
    'Профессионализм тренера и умение мобилизовать людей всегда отличает Марию Елагину. Супер!!! ',
    'Хочу выразить огромную благодарность моему персональному тренеру Наталье Ериной за ее профессионализм и по истине индивидуальный подход. За год тренировок она сделала и продолжает делать мое тело лучше! Очень рада, что занимаюсь именно с ней!',
    'Хочу поблагодарить замечательного тренера Наталью Ерину. Её тренировки построены всегда очень профессионально, эффективно и разнообразно. В нужный момент она может правильно подбодрить, занятия интересны, приносят удовольствие и отличный результат!',
    'Маша Елагина -  умничка, очень вежливо и профессионально объяснила мне функциональный тренинг, действие и взаимодействие всех необходимых тренажеров. Провела полноценную тренировку. Спасибо огромное!',
    'Отличная тренировка на нижнюю часть тела, прокачивается хорошо. Тренер Настя Орлова - молодец! Весёлая и шустрая! Интересно ходить к такому тренеру. Молодцы «Быстро-фитнес», что поставили такую тренировку.',
    'Гульнар Усманова -  самый лучший тренер. Всегда поправит, очень хорошо стимулирует. Заставляет нас попотеть на все 100%. Всегда с огромным удовольствием хожу на её занятия. Гульнар - умничка!!!',
    'Самый классный флекс на который попадала!!!Отличный инструктор – Надежда Лехина!!!И разгорелись хорошо, и потянулись отлично!!!И на гранатах сидели не по 8 секунд, как обычно, а по минуте!!!!Я даже села на левый!!! '
  ],
  genders: [
    'мужской',
    'женский',
    'неважно'
  ],
  intervals: [
    '10-30 мин',
    '30-50 мин',
    '50-80 мин',
    '80-100 мин'
  ],
  locations: [
    'Пионерская',
    'Петроградская',
    'Удельная',
    'Звёздная',
    'Спортивная'
  ],
  emails: [
    'exemple@gmail.com',
    'test@gmail.com',
    'user@mail.ru',
    'sport@mail.ru',
    'user-test@mail.ru',
    'custom@gmail.com'
  ],
  orderStatuses: [
    'на рассмотрении',
    'отклонён',
    'принят'
  ],
  paymentMethods: [
    'visa',
    'mir',
    'umoney'
  ],
  purchaseTypes: [
    'абонемент'
  ],
  trainingLevels: [
    'новичок',
    'любитель',
    'профессионал'
  ],
  trainingTypes: [
    'йога',
    'бег',
    'бокс',
    'стрейчинг',
    'кроссфит',
    'аэробика',
    'пилатес'
  ],
  titles: [
    'Похудение',
    'Силовой тренинг',
    'Mind&Body',
    'Танцы',
    'Тренажерный зал',
    'Кардиозона',
    'Круговая тренировка'
  ],
  backgrounds: [
  'training-01',
  'training-02',
  'training-03',
  'training-04',
  'training-05',
  'training-06',
  'training-07',
  'training-08',
  'training-09',
  'training-10',
  'training-11',
  'training-12',
  'preview-01',
  'preview-02',
  'preview-03',
  ],
  descriptions: [
    'Направлена на укрепление и развитие сердечнососудистой системы, избавление от лишних килограммов, повышение выносливости организма. Тренировку предпочтительнее начинать именно с кардиозоны, так как сначала вам необходимо подготовить свой организм к предстоящим силовым нагрузкам.',
    'Позволяет более тщательно проработать необходимые мышцы, уделить особое внимание проблемным зонам.',
    'Такой метод называется «движение по станциям». Вы перемещаетесь по кругу от одной станции к другой, от тренажера к месту для выполнения аэробного упражнения, которое повторяете за тренером. ',
    'Тренировки направлены на сжигание лишних калорий, улучшение работы сердечно-сосудистой и дыхательной систем. Способствуют снижению веса, повышению выносливости организма, развитию координации.',
    'Силовые групповые программы направлены на формирование упругого, красивого, гармонично сложенного тела. Включают в себя упражнения с отягощающим оборудованием: штанги, гири, гантели, бодибары. Занятия подходят тем, кто решил избавиться от лишнего веса, укрепить мышцы и усовершенствовать рельеф тела, а также устранить проявления целлюлита. ',
    'Групповые занятия направлены на совершенствование тела и гармонизацию внутреннего состояния. Уроки рекомендованы при заболеваниях позвоночника и суставов. Занятия делают тело гибким, препятствуют загрубению мышц, предотвращают боли в спине и суставах.',
    'Аэробная, силовая и функциональная нагрузки укрепляют сердечно-сосудистую и дыхательную системы. Танцевальные программы развивают координацию движений и чувство ритма, способствуют снижению веса и формированию красивой осанки.',
    'Кардионагрузки тренируют сердце. Во время выполнения упражнений происходит учащение сердечного ритма. За счет более интенсивной работы легких организм насыщается кислородом, происходит укрепление сердечно-сосудистой системы. '
  ],
  demoVideos: [
    'training-video.mp4'
  ],
  UserRoles: [
    'пользователь',
    'тренер'
  ],
  names: [
    'Марина Печенкина',
    'Инесса Фурсова',
    'Елена Штин',
    'Игорь Дридигер',
    'Роман Дмитриевич',
    'Андрей Ковалев'
  ],
  avatars: [
    'photo-1.png',
    'photo-2.png',
    'photo-3.png',
    'photo-4.png',
    'photo-5.png'
  ],
  password: '123456',
  userDescriptions: [
    'Мария – истинный профи. Работает в «Быстро-фитнес» 8 лет. За это время ни раз становилась участницей Международной фитнес-конвенций Worldclass и Mioff.',
    'Маша обожает танцевать. Это ее способ снять стресс и проявить свою чувственность. А заряжается энергией она в путешествиях по Черноморскому побережью и Кавказу. Очень приятное впечатление оставил у Маши казахстанский Атырау.',
    'Если вы поставили себе цель – иметь красивое тело, то будьте готовы к работе. Красота не требует жертв, красота требует упорного труда над собой и своей ленью.',
    'Для меня важно, чтобы клиентки уходили от меня с достигнутым результатом и отличным настроением.',
    'Движение - жизнь, следуй за своей мечтой!',
    'Чтобы дойти до цели, надо идти!'
  ],
  certificates: [
    'certificate-1.jpg',
    'certificate-2.jpg',
    'certificate-3.jpg',
    'certificate-4.jpg',
    'certificate-5.jpg',
    'certificate-6.jpg',
  ],
  resumes: [
    'Сертификат "Инструктор йоги" Студия Yoga Stefa, г. Москва, 2019 г.',
    'Сертификат участника семинара Анатолия Зенченко "Биомеханика асан в йоге" Центр йоги "Прана", г. Москва, 2020 г.',
    ' В 2021 году Эвелина вошла в тройку лучших спортсменов России среди студентов.',
    'У Кати - высшее образование в сфере Государственного и муниципального управления.',
    ' С клиентами быстро находит общий язык, потому что коммуникабельна и деликатна',
    'Людмила закончила Астраханский Государственный Университет, факультет <Физической культуры и спорта>',
  ],
  usersGenders: [
    'для мужчин',
    'для женщин',
    'для всех'
  ],
  messages: [
    'Вас пригласили в друзья',
    'Вас пригласили на тренировку',
    'У вас запросили персональную тренировку'
  ]
}
